OPENFOAM/buoyancy/cavidadeCubicaGasIncompressivel/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 310.00;

boundaryField
{
    hot
    {
        type            fixedValue;
        value           uniform 320.00;
    }
    cold
    {
        type            fixedValue;
        value           uniform 300.00;
    }
    fixedWalls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
